[
  {
    "Employer": "FSCA",
    "Position": "Senior Programmer: HR and Payroll",
    "Description": "",
    "Paragraph": "Was appointed by the FSCA (Financial Sector Conduct Authority) as a Senior Programmer for HR and Payroll on a 12-month Contract.  During my time at my previous company XFour solutions I was allocated to a project for the FSCA.  During this project I played a very central and pivotal role in making the implementation of the Sage ERP system a reality.  Months after the implementation of the project they had reached out to me.During my time there my duties were similar to those at XFour solutions outlined in the below section.  Some of the biggest achievements from my time there included.",
    "List": [
      " Resolving of the leave issues that the system had and by doing so ensuring helping ensure that the FSCA maintain their clean audit track record \n (the FSCA have gone many years with a clean audit and the leave was posing a risk to that)",
      " Being able to assist with establishing business processes that saw business return to using the expenses process after originally abandoning it due to lack of confidence.",
      " Realigning development and UAT environments with production through means of system backups and integrations",
      " Writing reports aimed at making life easier for business stakeholders"
    ],
    "DateFromMonth": "Mar",
    "DateFromYear": "2022",
    "DateToMonth": "July",
    "DateToYear": "2022"
  },
  {
    "Employer": "XFour Solutions",
    "Position": "Business Analyst and Developer",
    "Description": "",
    "Paragraph": "XFour is a company that implements and maintains business solutions for clients.  These solutions are mainly focused on Human Resources, Payroll and ERP systems.  Due to the systems used many of the clients were large leading south African businesses and in some many cases listed companies (Nandos, Ackemans, Cape Union Mart, FSCA,  Famous Brands, Ivanhoe, etc.). During my time there I would essentially meet with clients to establish their needs and then offer up solutions alterations within or around the framework of the relevant software solution, which often was Sage X3.  I would then be involved in the implementation or development of the solution.  My role compared to other developers at the company differed mainly in that I would be involved with more regularity in client interactions and needs analysis.  Furthermore, I was more frequently involved with providing business solutions when activities outside of programming was required i.e. (Functional Consulting). My biggest achievement during my time at XFour was being able assist a client called the FSCA (Financial Services Conduct Authority) where I fulfilled a pivotal role in getting the project over the line.  In many ways it was a coming together of all my skills learned since becoming starting work at x4 and serve as a good test of all my skills learned up to that point. Some of the other activities performed at XFour include the below.",
    "List": [
      " Developing employee portal screens and workflow rules for the training module on Sage X3.  This was rolled out at 3 or so clients.  At the time the system did not have employee portal screens for training.",
      " Was a handfull of custom GL solutions for clients.  Many clients using the Sage X3 System for payroll had different accounting systems and needed to integrate for GL purposes.  I handled 3 or 4 such integrations.  A combination of needs assessment, Functional setup, development of custom fields and programmatically writing out all the information to -integration files was required in all cases",
      " Created custom processes to help integrate various elements with external time and attendance systems.",
      " Wrote allot of reports often requiring addition of additional fields/screens to be created in the system first.",
      " Built an entire Sanctions/Disciplinary Portal Module in X3 for a client Screens, Table Workflows etc. "
    ],
    "DateFromMonth": "Sep",
    "DateFromYear": "2017",
    "DateToMonth": "Dec",
    "DateToYear": "2021"
  },
  {
    "Employer": "Optimum and Discovery",
    "Position": "Financial Advisor",
    "Description": "",
    "Paragraph": "Spent 4 years as a financial advisor marketing financial products including medical aid, Life insurance, investments, and short-term insurance.  During this time, I learned a lot about pension funds, investments etc.  However, I arrived looking for a analytical/technical job only to find what boils down to a sales job which is not something I had a passion for. Just for reference Financial Advisors work purely for commission in South Africa.  I think the biggest reason I stayed 4 years was that I had already had one career change and was scared another one would not be beneficial.  ",
    "List": [],
    "DateFromMonth": "Oct",
    "DateFromYear": "2013",
    "DateToMonth": "Sep",
    "DateToYear": "2017"
  },
  {
    "Employer": "Imperial Logistics",
    "Position": "Management Trainee and Later Contract Manager",
    "Description": "",
    "Paragraph": "Imperial Logistics is a JSE listed global logistics company.  At the time I was employed the company was made up of 70 logistics providers under one umbrella.  One of larger companies in that group was Imperial distribution essentially this is the business unit where I was employed.  The HR department for the Imperial Logistics group had a management trainee program.  A two-year training program where graduates were employed by one of the subsidiary companies.  You would then complete a curriculum whereby you are expected to be exposed to various departments from HR, Maintenance, Finance, IT and operations among others.  At the same time, you were also used by the company as operational requirements arose.  After completing the management trainee program after little over a year and a half, I was appointed to a contract manager position reporting into a then Area manager called Johan van Aswegen.  The business was based on a decentralized concept.  The business would have clients to which it would dedicate vehicles and staff fulltime for the duration of the contract.  So, the structure would normally be Contract Manager, supervisor/s, Drivers and Crew.   So, what you end up with on these contracts are smaller self-contained business units with centralized support services for Maintenance and Administration.  It was a fantastic opportunity for a young ambitious person as I was at the time in that it provided an exposure to all elements of managing a business with centralized support and oversight.  I as the contract manager was responsible for all aspects of operations management HR, budgeting and finance, scheduling of trips and staff, negotiating with service suppliers.  The first site I was assigned was 10 vehicles ranging in size from 8-12 ton and had 16 staff members.  I look back fondly on that period of just over a year.  After this I was assigned a site with 12 30-ton vehicles and in total 60 staff members.  Although I was doing well in keeping the operation ticking over reducing stock losses etc, after about 6 months of running such a large business at a relatively young age I had just about had enough.  I remembered wanting to look for something more analytical and less operational.  Which led me into a next chapter as a Financial Advisor. ",
    "List": [],
    "DateFromMonth": "Jan",
    "DateFromYear": "2011",
    "DateToMonth": "Sep",
    "DateToYear": "2013"
  }
]
