[
  {
    "Employer": "FSCA",
    "Position": "Senior Programmer: HR and Payroll",
    "Description": "",
    "Paragraph": "Was appointed by the FSCA (Financial Sector Conduct Authority) as a Senior Programmer for HR and Payroll on a 12-month Contract.  During my time at my previous company XFour solutions I was allocated to a project for the FSCA.  During this project I played a very central and pivotal role in making the implementation of the Sage ERP system a reality.  Months after the implementation of the project they had reached out to me.During my time there my duties were similar to those at XFour solutions outlined in the below section.  Some of the biggest achievements from my time there included.",
    "List": [
      "1. Resolving of the leave issues that the system had and by doing so ensuring helping ensure that the FSCA maintain their clean audit track record \n (They have gone many years with a clean audit and the leave was posing a risk to that)",
      "2. Being able to assist with establishing business processes that saw business return to using this process after originally abandoning it due to lack of confidence.",
      "3. Realigning development and UAT environments with production through means of system backups and integrations",
      "4. Writing reports aimed at making life easier for business stakeholders"
    ],
    "DateFromMonth": "Mar",
    "DateFromYear": "2022",
    "DateToMonth": "July",
    "DateToYear": "2022"
  },
  {
    "Employer": "XFour Solutions",
    "Position": "Senior Programmer: HR and Payroll",
    "Description": "",
    "Paragraph": "XFour is a company that implements and maintains business solutions for clients.  These solutions are mainly focused on Human Resources, Payroll and ERP systems.  Due to the systems used many of the clients were large leading south African businesses and in some many cases listed companies (Nandos, Ackemans, Cape Union Mart, FSCA,  Famous Brands, Ivanhoe, etc.). During my time there I would essentially meet with clients to establish their needs and then offer up solutions alterations within or around the framework of the relevant software solution, which often was Sage X3.  I would then be involved in the implementation or development of the solution.  My role compared to other developers at the company differed mainly in that I would be involved with more regularity in client interactions and needs analysis.  Furthermore, I was more frequently involved with providing business solutions when activities outside of programming was required i.e. (Functional Consulting). My biggest achievement during my time at XFour was being able assist a client called the FSCA (Financial Services Conduct Authority) where I fulfilled a pivotal role in getting the project over the line.  In many ways it was a coming together of all my skills learned since becoming starting work at x4 and serve as a good test of all my skills learned up to that point. Some of the other activities performed at XFour include the below.",
    "List": [
      "1. Developing employee portal screens and workflow rules for the training module on Sage X3.  This was rolled out at 3 or so clients.  At the time the system did not have employee portal screens for training.",
      "2. Was a handfull of custom GL solutions for clients.  Many clients using the Sage X3 System for payroll had different accounting systems they needed to integrate for GL purposes.  I handled 3 or 4 such integrations.  A combination of needs assessment, Functional setup, development of custom fields and programmatically writing out all the information to -integration files was required in all cases",
      "3. Created custom processes to help integrate various elements with external time and attendance systems.",
      "4. Wrote allot of reports often requiring addition of additional fields/screens to be created in the system first.",
      "5. Built an entire Sanctions/Disciplinary Module in X3 for a client Screens, Table Workflows etc. "
    ],
    "DateFromMonth": "Sep",
    "DateFromYear": "2017",
    "DateToMonth": "Dec",
    "DateToYear": "2021"
  }
]
